       IDENTIFICATION DIVISION.
       PROGRAM-ID. TEST10.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER.  PC.
       OBJECT-COMPUTER.  PC.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 WK-JOBID    PIC X(6).
       PROCEDURE DIVISION.
       MAIN SECTION.
       P-X.
           DISPLAY "BJ_JOBID" UPON ENVIRONMENT-NAME.
           ACCEPT  WK-JOBID   FROM ENVIRONMENT-VALUE.
           DISPLAY WK-JOBID.
           GOBACK.

