@SET    BJ_FUTIL_PARAOPT 'MSP'
@PARAM
IF=(FN=%INDATA%FSEQ_40,RECL=40)
OF=(FN=%OTDATA%MVS_INC_CH_GT,ORG=S,RECL=40)
 INCLUDE COND=(1,5,CH,GT,C'160XX')
@PEND
\BJ_FLCNV
@SET QUTESTID  'MVS_INC_CH_GT'
@INSERT jcl\QU_INSERT.txt
