@SET BJ_FUTIL_PARAOPT 'MSP'
@PARAM
IF=(FN=%INDATA%VSEQ_20,ORG=SEQ,RECL=1,20)
OF=(FN=%OTDATA%MVS_IF_VSEQ,RECL=100,120)
 SORT FIELDS=(4,2,CH,A)
@PEND
\BJ_SORT
@end
@SET QUTESTID  'MVS_IF_VSEQ'
@SET QUFNAME1  '%OTDATA%MVS_IF_VSEQ'
@SET QUFNAME2  '%OTDATA%MVS_IF_VSEQ'
\QUCOMP128
