@SET BJ_FUTIL_PARAOPT 'MVS'
@PARAM
IF=(FN=%INDATA%FSEQ_40,RECL=40)
OF=(FN=%OTDATA%ISS_KEY1_COPY,RECL=40)
 SORT FIELDS=COPY
@PEND
\BJ_SORT
@SET QUTESTID  'ISS_KEY1_COPY'
@INSERT jcl\QU_INSERT.txt