@SET BJ_FUTIL_PARAOPT 'MVS'
@PARAM
IF=(FN=%INDATA%FSEQ_40,RECL=40)
OF=(FN=%OTDATA%ISS_KEY1_FL4,RECL=40)
 SORT FIELDS=(27,4,FL,A)
@PEND
\BJ_SORT
@SET QUTESTID  'ISS_KEY1_FL4'
@INSERT jcl\QU_INSERT.txt