@SET BJ_FUTIL_PARAOPT 'MVS'
@PARAM
IF=(FN=%INDATA%FSEQ_40,RECL=40)
OF=(FN=%OTDATA%ISS_KEY1_SUM_FL4,RECL=40)
 SORT FIELDS=(4,2,CH,A)
 SUM  FIELDS=(27,4,FL)
@PEND
\BJ_SORT
@SET QUTESTID  'ISS_KEY1_SUM_FL4'
@INSERT jcl\QU_INSERT.txt
