@SET BJ_FUTIL_PARAOPT 'MSP'
@PARAM
IF=(FN=%INDATA%FSEQ_40,RECL=40)
OF=(FN=%OTDATA%ISS_INC_KEY1_OR,RECL=40)
 SORT FIELDS=(13,2,BI,A)
 INCLUDE COND=(4,2,CH,EQ,C'AA',OR,7,5,ZD,EQ,475)
@PEND
\BJ_SORT
@SET QUTESTID  'ISS_INC_KEY1_OR'
@INSERT jcl\QU_INSERT.txt
