@SET BJ_FUTIL_PARAOPT 'MVS'
@PARAM
IF=(FN=%INDATA%FSEQ_40,RECL=40)
OF=(FN=%OTDATA%ISS_KEY1_PD,RECL=40)
 SORT FIELDS=(21,5,PD,A)
@PEND
\BJ_SORT
@SET QUTESTID  'ISS_KEY1_PD'
@INSERT jcl\QU_INSERT.txt