@SET    BJ_FUTIL_PARAOPT 'MSP'
@PARAM
IF=(FN=%INDATA%FSEQ_40,RECL=40)
OF=(FN=%OTDATA%ISS_INC_KEY1_DSC,ORG=S,RECL=40)
 SORT FIELDS=(7,5,ZD,D)
 INCLUDE COND=(7,5,ZD,GT,-300,&,7,5,ZD,LT,300)
@PEND
\BJ_SORT
@SET QUTESTID  'ISS_INC_KEY1_DSC'
@INSERT jcl\QU_INSERT.txt
