@SET BJ_FUTIL_PARAOPT 'MVS'
@PARAM
IF=(FN=%INDATA%FTXT_15,ORG=T,RECL=5,15)
OF=(FN=%OTDATA%ISS_KEY1_ASCII,ORG=T,RECL=5,15)
 SORT FIELDS=(1,6,CH,A)
@PEND
\BJ_SORT
@SET QUTESTID  'ISS_KEY1_ASCII'
@param
F1=(FN=%OTDATA%ISS_KEY1_ASCII,ORG=T,RECL=5,15)
F2=(FN=%CTDATA%ISS_KEY1_ASCII,ORG=T,RECL=5,15)
@pend
\QU_FCOMP
