@SET BJ_FUTIL_PARAOPT 'MVS'
@PARAM
IF=(FN=%INDATA%FSEQ_40,RECL=40)
OF=(FN=%OTDATA%ISS_KEY1_FL8,RECL=40)
 SORT FIELDS=(32,8,FL,A)
@PEND
\BJ_SORT
@SET QUTESTID  'ISS_KEY1_FL8'
@INSERT jcl\QU_INSERT.txt