@SET BJ_FUTIL_PARAOPT 'MVS'
@PARAM
IF=(FN=%INDATA%FSEQ_40,RECL=40)
OF=(FN=%OTDATA%ISS_KEY1_SUM_P,RECL=40)
 SORT FIELDS=(4,2,CH,A)
 SUM  FIELDS=(21,5,PD)
@PEND
\BJ_SORT
@SET QUTESTID  'ISS_KEY1_SUM_P'
@INSERT jcl\QU_INSERT.txt
