@SET BJ_FUTIL_PARAOPT 'MSP'
@PARAM
IF=(FN=%INDATA%FSEQ_40,RECL=40)
OF=(FN=%OTDATA%ISS_KEY1_BI,RECL=40)
 SORT FIELDS=(13,2,BI,A)
@PEND
\BJ_SORT
@SET QUTESTID  'ISS_KEY1_BI'
@INSERT jcl\QU_INSERT.txt