@SET BJ_FUTIL_PARAOPT 'MVS'
@PARAM
IF=(FN=%INDATA%FSEQ_40,RECL=40)
OF=(FN=%OTDATA%ISS_KEY1_CH,RECL=40)
 SORT FIELDS=(4,3,CH,A)
@PEND
\BJ_SORT
@SET QUTESTID  'ISS_KEY1_CH'
@INSERT jcl\QU_INSERT.txt