@SET BJ_FUTIL_PARAOPT 'MVS'
@PARAM
IF=(FN=%INDATA%FSEQ_40,RECL=40)
OF=(FN=%OTDATA%MVS_KEY1_ZD,RECL=40)
 SORT FIELDS=(7,5,ZD,A)
@PEND
\BJ_SORT
@SET QUTESTID  'MVS_KEY1_ZD'
@INSERT jcl\QU_INSERT.txt