@SET BJ_FUTIL_PARAOPT 'MSP'
@PARAM
IF=(FN=%INDATA%GEN_SEQ.dat,RECL=40)
OF=(FN=%OTDATA%MVS_INC_KEY1_OR,RECL=40)
 SORT FIELDS=(13,2,BI,A)
 INCLUDE COND=(4,2,CH,EQ,C'AA',OR,7,5,ZD,EQ,475)
@PEND
\BJ_SORT
\STEP GEN_PRINT
@FILE GEN_PRINT_IN FN=%OTDATA%MVS_INC_KEY1_OR
@FILE GEN_PRINT_OT FN=%OTDATA%MVS_INC_KEY1_OR.txt
\EXEC
@SET QUTESTID  'MVS_INC_KEY1_OR'
@SET QUFNAME1  '%OTDATA%MVS_INC_KEY1_OR'
@SET QUFNAME2  '%OTDATA%MVS_INC_KEY1_OR'
\QUCOMP
