@SET BJ_FUTIL_PARAOPT 'MVS'
@PARAM
IF=(FN=%INDATA%FSEQ_30,RECL=30)
OF=(FN=%OTDATA%MVS_KEY1_K,RECL=30)
 SORT FIELDS=(6,4,JEF,A)
@PEND
\BJ_SORT
@SET QUTESTID  'MVS_KEY1_K'
@INSERT jcl\QU_INSERT30.txt