       01 BJ-CATLG-EXTERNAL            EXTERNAL.
            05  CFG-CATLG-USE          PIC X.
            05  CFG-CATLG-ONLY-SEQF    PIC X.
            05  CFG-CATLG-DYN-UPDATE   PIC X.
            05  CFG-JOB-TMPDIR-L       PIC X     COMP-X.
            05  CATLG-MST-FILE         PIC X(256).
            05  CATLG-TMP-FILE         PIC X(256).
