           SELECT      CATLG-F  ASSIGN  TO dynamic  CATLG-FNAME
                       ORGANIZATION          IS INDEXED
                       RECORD KEY            IS CATLG-PKEY
                       ACCESS      MODE      IS RANDOM
                       LOCK MODE   AUTOMATIC
                       FILE        STATUS    F-STS.
