       FD  CATLG-F.
       01  CATLG-REC.
           05  CATLG-MIN-RECL            PIC 9(6).
           05  CATLG-MAX-RECL            PIC 9(6).
           05  CATLG-PKEY.
             10  CATLG-FORG              PIC X.
             10  CATLG-FPATH             PIC X(128).
