@SET    BJ_FUTIL_PARAOPT 'MSP'
@PARAM
IF=(FN=%INDATA%FSEQ_40,RECL=40)
OF=(FN=%OTDATA%MVS_OUT_003,ORG=T,RECL=40)
  OUTREC FIELDS=(4,2,X'31',C'a',X'323334') 
@PEND
\BJ_FLCNV
@SET QUTESTID  'MVS_OUT_003'
@INSERT jcl\QU_INSERT_T.txt
