@SET    BJ_FUTIL_PARAOPT 'MSP'
@PARAM
IF=(FN=%INDATA%FSEQ_40,RECL=40)
OF=(FN=%OTDATA%MVS_INC_PD_EQ,ORG=S,RECL=40)
 INCLUDE COND=(21,5,PD,EQ,443847)
@PEND
\BJ_FLCNV
@SET QUTESTID  'MVS_INC_PD_EQ'
@INSERT jcl\QU_INSERT.txt
