@SET    BJ_FUTIL_PARAOPT 'MSP'
@PARAM
IF=(FN=%INDATA%FSEQ_40,RECL=40)
OF=(FN=%OTDATA%MVS_INC_ALL,ORG=S,RECL=40)
 INCLUDE COND=ALL
@PEND
\BJ_FLCNV
@SET QUTESTID  'MVS_INC_ALL'
@INSERT jcl\QU_INSERT.txt
