@SET    BJ_FUTIL_PARAOPT 'MSP'
@PARAM
IF=(FN=%INDATA%FSEQ_40,RECL=40)
OF=(FN=%OTDATA%MVS_OUT_002,ORG=T,RECL=50)
 OUTREC FIELDS=(C'a=',1,3,C'b=',4,3)
@PEND
\BJ_FLCNV
@SET QUTESTID  'MVS_OUT_002'
@INSERT jcl\QU_INSERT_T.txt
