@SET    BJ_FUTIL_PARAOPT 'MSP'
@PARAM
IF=(FN=%INDATA%FSEQ_40,RECL=40)
OF=(FN=%OTDATA%MVS_INC_AND1,ORG=S,RECL=40)
 INCLUDE COND=(7,5,ZD,GT,0,AND,7,5,ZD,LE,350)
@PEND
\BJ_FLCNV
@SET QUTESTID  'MVS_INC_AND1'
@INSERT jcl\QU_INSERT.txt
