@SET    BJ_FUTIL_PARAOPT 'MSP'
@PARAM
IF=(FN=%INDATA%FSEQ_40,RECL=40)
OF=(FN=%OTDATA%MVS_INC_CH_EQ2,ORG=S,RECL=40)
 INCLUDE COND=(4,2,CH,EQ,C'SS')
@PEND
\BJ_FLCNV
@SET QUTESTID  'MVS_INC_CH_EQ2'
@INSERT jcl\QU_INSERT.txt
