@SET    BJ_FUTIL_PARAOPT 'MSP'
@PARAM
IF=(FN=%INDATA%FSEQ_40,RECL=40)
OF=(FN=%OTDATA%MVS_OUT_001,ORG=T,RECL=50)
  OUTREC FIELDS=(1,5,5X,5C'a',10X'42',3X'323334') 
@PEND
\BJ_FLCNV
@SET QUTESTID  'MVS_OUT_001'
@INSERT jcl\QU_INSERT_T.txt
