@SET    BJ_FUTIL_PARAOPT 'MSP'
@PARAM
IF=(FN=%INDATA%FSEQ_40,RECL=40)
OF=(FN=%OTDATA%MVS_FORMAT_PD,ORG=S,RECL=40)
 INCLUDE COND=(21,5,EQ,443847,|,21,5,EQ,-321241),FORMAT=PD
@PEND
\BJ_FLCNV
@SET QUTESTID  'MVS_FORMAT_PD'
@INSERT jcl\QU_INSERT.txt
