@SET    BJ_FUTIL_PARAOPT 'MSP'
@PARAM
IF=(FN=%INDATA%FSEQ_40,RECL=40)
OF=(FN=%OTDATA%MVS_INC_CH_GE,ORG=S,RECL=40)
 INCLUDE COND=(1,5,CH,GE,C'190VV')
@PEND
\BJ_FLCNV
@SET QUTESTID  'MVS_INC_CH_GE'
@INSERT jcl\QU_INSERT.txt
