@SET    BJ_FUTIL_PARAOPT 'MSP'
@PARAM
IF=(FN=%INDATA%FSEQ_40,RECL=40)
OF=(FN=%OTDATA%MVS_FORMAT_CH,ORG=S,RECL=40)
 INCLUDE COND=(4,2,EQ,C'EE',OR,7,5,ZD,EQ,-306),FORMAT=CH
@PEND
\BJ_FLCNV
@SET QUTESTID  'MVS_FORMAT_CH'
@INSERT jcl\QU_INSERT.txt