@SET    BJ_FUTIL_PARAOPT 'MSP'
@PARAM
IF=(FN=%INDATA%FSEQ_40,RECL=40)
OF=(FN=%OTDATA%MVS_FORMAT_ZD,ORG=S,RECL=40)
 INCLUDE COND=(4,2,CH,EQ,C'AA',OR,7,5,EQ,-492),FORMAT=ZD
@PEND
\BJ_FLCNV
@SET QUTESTID  'MVS_FORMAT_ZD'
@INSERT jcl\QU_INSERT.txt
