@SET    BJ_FUTIL_PARAOPT 'MSP'
@PARAM
IF=(FN=%INDATA%FSEQ_40,RECL=40)
OF=(FN=%OTDATA%MVS_INC_CH_EQ,RECL=40)
  INCLUDE COND=(1,3,CH,EQ,C'080')
@PEND
\BJ_FLCNV
@SET QUTESTID  'MVS_INC_CH_EQ'
@INSERT jcl\QU_INSERT.txt
