@SET    BJ_FUTIL_PARAOPT 'MSP'
@PARAM
IF=(FN=%INDATA%FSEQ_40,RECL=40)
OF=(FN=%OTDATA%MVS_INC_ZD_GE,ORG=S,RECL=40)
 INCLUDE COND=(7,5,ZD,GE,-78)
@PEND
\BJ_FLCNV
@SET QUTESTID  'MVS_INC_ZD_GE'
@INSERT jcl\QU_INSERT.txt
